---
kind: property
id: P:Autodesk.Revit.DB.OpenOptions.DetachFromCentralOption
source: html/5db03f57-b7fa-a1fa-e8b2-289c80678e75.htm
---
# Autodesk.Revit.DB.OpenOptions.DetachFromCentralOption Property

An option that specifies whether or not a workset-enabled document is detached from its central document.

## Syntax (C#)
```csharp
public DetachFromCentralOption DetachFromCentralOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration